{
  "how do solar panels work": "Solar panels capture sunlight and convert it into electricity using photovoltaic (PV) cells.",
  "what are the benefits of installing solar panels": "Solar panels help you save money on electricity, reduce your carbon footprint, and increase your property value.",
  "what are solar incentives in california": "California offers incentives like net metering, the Self-Generation Incentive Program (SGIP), and local rebates to promote solar adoption.",
  "how much money can i save with solar": "Homeowners typically save between $10,000 and $30,000 over the lifetime of a solar panel system.",
  "what is net metering": "Net metering allows you to earn credits by sending excess solar electricity back to the grid, reducing your electricity bill.",
  "how long do solar panels last": "Solar panels typically last 25 to 30 years or longer with proper maintenance.",
  "do solar panels work on cloudy days": "Yes, solar panels still generate electricity on cloudy days, though production is reduced compared to sunny days.",
  "how much does it cost to install solar panels": "On average, solar installation costs between $15,000 and $25,000 before incentives, depending on system size and location.",
  "can i install solar panels myself": "It's recommended to use certified solar installers to ensure safety, compliance, and eligibility for incentives.",
  "what maintenance do solar panels need": "Solar panels require minimal maintenance, mostly occasional cleaning and annual inspections to maintain efficiency.",
  "what is a solar battery": "A solar battery stores excess electricity produced during the day so you can use it at night or during outages.",
  "are there solar incentives in texas": "Texas offers net metering through some utilities and local rebate programs, but incentives vary widely by city and provider.",
  "do solar panels increase home value": "Yes, studies show that homes with solar panels sell faster and for more money compared to non-solar homes.",
  "how many solar panels do i need": "The number of panels depends on your electricity usage, available roof space, and sunlight exposure in your area.",
  "what is a solar inverter": "A solar inverter converts the direct current (DC) electricity produced by solar panels into usable alternating current (AC) electricity.",
  "what is the federal solar tax credit": "The federal solar Investment Tax Credit (ITC) allows you to deduct 30% of your solar installation costs from your federal taxes.",
  "can solar panels eliminate my electric bill": "Solar panels can significantly reduce or even eliminate your electricity bill, depending on system size and energy usage.",
  "what happens if my solar panels produce more electricity than i use": "Excess electricity is usually sent back to the grid, and you may earn credits through net metering.",
  "what are the disadvantages of solar energy": "Disadvantages include upfront costs, dependence on weather conditions, and lower efficiency at night or in heavily shaded areas.",
  "how do solar leases and power purchase agreements (ppas) work": "Solar leases and PPAs allow you to install solar panels with little to no upfront cost while paying a monthly fee for the power produced."
}
